src/main/resources/webServiceRequestXmls/Load_Reload.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:elt="http://eltws.map.ecs.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <elt:callExtAPITransactions>
         <!--Optional:-->
         <extAPITxnRequest>
            <!--Optional:-->
            <userId>654321</userId>
            <!--Optional:-->
            <sessionKey>313OY7VEQ8R9Q45W34I9WXB</sessionKey>
            <!--Optional:-->
            <channel>31</channel>
            <!--Optional:-->
            <passCodeFlag>N</passCodeFlag>
            <!--Optional:-->
            <passCode></passCode>
            <!--Optional:-->
            <emvData></emvData>
            <!--Optional:-->
            <formFactorType>CRD</formFactorType>
            <!--Optional:-->
            <formFactorExpiryDate>1901</formFactorExpiryDate>
            <!--Optional:-->
            <transactionCounter>1003</transactionCounter>
            <!--Optional:-->
            <transactionType>O</transactionType>
            <!--Optional:-->
            <rrn>985999550118</rrn>
            <!--Optional:-->
            <transactionCode>LC</transactionCode>
            <!--Optional:-->
            <transactionDateTime>20170512081817</transactionDateTime>
            <!--Optional:-->
            <txnCurrency>764</txnCurrency>
            <!--Optional:-->
            <txnamount>1</txnamount>
            <!--Optional:-->
            <currencyConversionRate></currencyConversionRate>
            <!--Optional:-->
            <mcc>5499</mcc>
            <!--Optional:-->
            <acceptorTerminalId></acceptorTerminalId>
            <!--Optional:-->
            <acceptorMerchantId></acceptorMerchantId>
            <!--Optional:-->
            <acceptorNameLocation></acceptorNameLocation>
            <!--Optional:-->
            <remarks>LOAD API</remarks>
            <!--Optional:-->
            <formFactor>5512340000000100162</formFactor>
            <!--Optional:-->
            <pinBlock></pinBlock>
            <!--Optional:-->
            <newPinBlock></newPinBlock>
            <!--Optional:-->
            <fromPAN></fromPAN>
            <!--Optional:-->
            <toPAN></toPAN>
            <!--Optional:-->
            <traceAuditNumber>742754</traceAuditNumber>
            <!--Optional:-->
            <billingAmt>1</billingAmt>
            <!--Optional:-->
            <billingCurrency>764</billingCurrency>
            <!--Optional:-->
            <originalDateTimeTransmission></originalDateTimeTransmission>
            <!--Optional:-->
            <dateTimeTransmission>1220142202</dateTimeTransmission>
            <!--Optional:-->
            <originalTraceAuditNumber></originalTraceAuditNumber>
         </extAPITxnRequest>
      </elt:callExtAPITransactions>
   </soapenv:Body>
</soapenv:Envelope>